# 1. ვიქტორინა
# შეადგინე ვიქტორინის პროგრამა. მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი
# იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?”
# სავარაუდო პასუხები:
# 1. შუმერთა
# 2. სელჩუკთა
# 3. რომის
# 4. მონღოლთა
# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი.
# შეცდომის შემთხვევაში იბეჭდება:
# „არა! სწორი პასუხია რომის!“
# სწორი პასუხის შემთხვევაში იბეჭდება:
# „სწორია!“

ask=input('''
რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?
სავარაუდო პასუხები:
1. შუმერთა
2. სელჩუკთა
3. რომის
4. მონღოლთა

''')

if ask=='რომის' or ask==str(3):
    print('სწორია!')
else:
    print('არა! სწორი პასუხია რომის!')

# 2. ონლაინ მაღაზია
# პროგრამა გთავაზობს პროდუქტის სამ კატეგორიას.
# მაგ.
# 1. ლეპტოპები
# 2. პერსონალური კომპიუტერები
# 3. მობილურები
# მომხმარებელი ირჩევს ერთ-ერთს.
# პროგრამა ითხოვს მაქსიმალურ ბიუჯეტს და ბიუჯეტის მიხედვით სთავაზობს
# მომხმარებელს კონკრეტულ მოდელს არჩეულ კატეგორიაში.
# (თითო კატეგორიაში მინიმუმ 3 პროდუქტი მაინც უნდა იყოს)
#
# თუ ბიუჯეტი ძალიან მცირეა, პროგრამა ბეჭდავს, რომ ამ თანხაში არ გააჩნია
# შემოთავაზება.
#
model = input('''
აირჩიეთ ერთი:
1. ლეპტოპები
2. პერსონალური კომპიუტერები
3. მობილურები

''')

budget=int(input('მაქსიმალური ბიუჯეტი: '))

if model=='ლეპტოპები':
    if budget < 699:
        print('ამ თანხაში არ გაგვაჩნია შემოთავაზება')
    elif budget<=1500:
        print('''
        1. Lenovo Ideapad 1 (82R400AERK) - Cloud Grey
        2. Lenovo IdeaPad 3 15IAU7 (82RK00R3RK) - Arctic Grey
        3. Asus Vivobook Go 15 (E1504FA-BQ415) - Cool Silver
        ''')
    elif budget<=2500:
        print('''
        1. Asus TUF Gaming F15 (FX507ZC4-HN009) - Mecha Gray
        2. Asus Vivobook 16X (M1603QA-MB120) - Quiet Blue
        3. HP Pavilion 15 (84J95EA) - Natural Silver
        ''')
    elif budget<=3500:
        print('''
        1. Apple MacBook Air 13'' M1 (8GB/256GB) - Space Gray (2020)
        2. Asus TUF Gaming A16 (FA617NS-N3003) - Off Black
        3. Apple MacBook Air 13" M2 8-core CPU and 8-core GPU (8GB/256GB) SSD - Midnight
        ''')

    elif budget<=5000:
        print('''
        1. Asus ROG Strix G16 (G614JV-N4072)
        2. Apple MacBook Pro 13" M2 8-core CPU and 10-core GPU (8GB/256GB) SSD - Sp...
        3. Asus ROG Zephyrus G14 (2022) (GA402RJ-L4154W) - Gray
        ''')

if model=='პერსონალური კომპიუტერები':
    if budget < 2000:
        print('ამ თანხაში არ გაგვაჩნია შემოთავაზება')
    elif budget<=3000:
        print('''
        1. Lenovo
        2. Dell
        3. Acer
        ''')
    elif budget<=4000:
        print('''
        1. SBOX
        2. Samsung
        3. Dicota
        ''')
    elif budget<=5000:
        print('''
        1. Apple
        2. Asus
        3. HP
        ''')

if model=='მობილურები':
    if budget < 500:
        print('ამ თანხაში არ გაგვაჩნია შემოთავაზება')
    elif budget<=1000:
        print('''
        1. Xiaomi 13 Lite (8GB/256GB) Dual Sim LTE/5G - Black
        2. Honor 90 (8GB/256GB) Dual Sim LTE Midnight Black
        3. Samsung A556E Galaxy A55 (8GB/128GB) Dual Sim 5G - Dark Blue
        ''')
    elif budget<=2000:
        print('''
        1. Samsung Galaxy Flip4 5G (8GB/256GB) - Blue
        2. Apple iPhone 13 128GB Blue
        3. OnePlus 10T 5G (8GB/128GB) Dual sim - Black
        ''')
    elif budget<=3000:
        print('''
        1. Google Pixel 8 Pro 5G (12GB/256GB) - Porcelain
        2. Samsung S926B Galaxy S24 Plus (12GB/256GB) LTE/5G Dual Sim - Black
        3. Apple iPhone 14 Plus 128GB Purple
        ''')



# 3. ქუესთის შედგენა (Text Based Adventure Game)
# დაწერე ერთმანეთში ჩასმული if-else კონსტრუქციების
# გამოყენებით მარტივი ტექსტზე დაფუძნებული სათავგადასავლო თამაში.
# მაგ. თავიდან პროგრამა ბეჭდავს მომხმარებლის ადგილსამყოფელს და სთავაზობს
# მქომედების რამდენიმე ვარიანტს. სხვადასხვა არჩევანის შემთხვევაში თამაშ
# სხვადასხვანაირად ვითარდება.

print('შიმშილის თამაშები!')
start=input('''თამაში დაიწყო: აირჩიეთ 1 ან 2
            1. მიდიხართ იარაღების ასაღებად
            2. მიდიხართ თავშესაფრის საძიებლად

            ''')
if start=='1':
    ask=input('''რომელ იარაღს ირჩევთ: აირჩიეთ 1, 2 ან 3
    1. დანას
    2. მშვილდოსანს
    3. ხმალს
    ''')
    next=input('''აირჩიეთ 1 ან 2
    1. მიდიხართ თავშესაფრის საძიებლად
    2. იწყებთ სხვა მონაწილეებთან ბრძოლას
    ''')
    if next==2:
        print('თქვენ მოკვდით. თამაში დასრულდა!')
    else:
        where=input('''აირჩიეთ 1 ან 2
        1. მიდიხართ ტყეში და ადიხართ ხეზე
        2. წვებით მინდორზე თავს იხატავთ მწვანედ რომ ბალახზე არ გამოჩნდეთ
        ''')
        if where=='1':
            print('თქვენ კარგად დაიმალეთ და გადარჩით. გილოცავთ!')
        else:
            print('თქვენ ფეხი დაგადგეს და მოკვდით. თამაში დასრულდა!')

else:
    where = input('''აირჩიეთ 1 ან 2
            1. მიდიხართ ტყეში და ადიხართ ხეზე
            2. წვებით მინდორზე თავს იხატავთ მწვანედ რომ ბალახზე არ გამოჩნდეთ
            ''')
    if where == '1':
        print('თქვენ კარგად დაიმალეთ და გადარჩით. გილოცავთ!')
    else:
        print('თქვენ ფეხი დაგადგეს და მოკვდით. თამაში დასრულდა!')


#4. კარიერის შემრჩევი
# პროგრამა უსვამს მომხმარებელს რამდენიმე კითხვას
# (თქვენი იმპროვიზაციით) და ურჩევს მისთვის შესაფერის
# პროფესიას.

ask=input('ინტროვერტი ხართ თუ ექსტროვერტი: ')
if ask=='ინტროვერტი':
    ask2=input('ჰუმანიტარი ხართ თუ ტექნიკოსი: ')
    if ask2=='ჰუმანიტარი':
        print('იურისტი')
    else:
        print('პროგრამისტი')
else:
    ask2 = input('ჰუმანიტარი ხართ თუ ტექნიკოსი: ')
    if ask2 == 'ჰუმანიტარი':
        print('ჟურნალისტი')
    else:
        print('არქიტექტურა')




